Revit 2027 API
BoundaryConditions.GetBoundaryConditionsType Method
 Returns the boundary conditions type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundaryConditionsType GetBoundaryConditionsType()
Public Function GetBoundaryConditionsType As BoundaryConditionsType
public:
BoundaryConditionsType GetBoundaryConditionsType()
member GetBoundaryConditionsType : unit -> BoundaryConditionsType
Return Value
BoundaryConditionsType
 The boundary conditions type.
See Also
Reference
BoundaryConditions Class
Autodesk.Revit.DB.Structure Namespace